 
{
  "data": [
    {
      "date": 1709047025,
      "link": "https://t.me/freelance_ethio/64536",
      "content": "Job Title: Senior Accountant  Job Type: On-site - Permanent (Full-time)  Job Sector: #Accounting_and_finance  Work Location: Addis Ababa, Ethiopia  Experience Level: Expert  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: We are seeking a highly skilled and experienced Senior Accountant to join our team. The ideal candidate should have a minimum of 5 years of accounting experience, with at least 2 years in a senior accounting position. Experience working in an agency setting is a significant plus.  Responsibilities:      Manage and oversee the daily operations of the accounting department     Prepare financial statements and reports for management     Supervise and mentor junior accounting staff     Ensure compliance with accounting policies and procedures     Review and analyze financial data to support business decisions     Assist in the preparation of budgets and forecasts     Coordinate with external auditors during annual audits     Identify areas for process improvement and implement changes as needed  Requirements:      Bachelor's degree in Accounting or Finance     CPA certification preferred     5+ years of accounting experience, with at least 2 years in a senior accounting role     Proficiency in financial accounting software and Microsoft Excel     Strong analytical and problem-solving skills     Excellent communication and interpersonal skills     Ability to work independently and as part of a team     Experience working in an agency environment is a plus  If you meet the above requirements and are looking for a challenging and rewarding opportunity as a Senior Accountant, we encourage you to apply. Join our team and contribute to our continued success!  To Apply Use This Link https://forms.gle/Tp9VCFJfrwt5VkNKA  __________________  A.R.S [Verified Licensed Startup 🚀]  88 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709046503,
      "link": "https://t.me/freelance_ethio/64535",
      "content": "Job Title: Graphic designer and video editor  Job Type: On-site - Permanent (Full-time)  Job Sector: #Media_and_communication  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Designing ads from concept to end product and editing videos for social media campaigns  __________________  Addget Design & Print PLC [Verified Company ✅]  5 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709046134,
      "link": "https://t.me/freelance_ethio/64534",
      "content": "Job Title: የስፌት  ባለሙያ  Job Type: On-site - Permanent (Full-time)  Job Sector: #Clothing_and_Textile  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 1  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: ድርጅታችን ኢንተርሎክ እና ኦቨር ሎክ ማሽን ላይ መስፋት የምትችል ሰራተኛ መቅጠር ይፈልጋል፡፡ የስራ ሰዐት ከሰኞ - አርብ ከ 2፡30 - 11፡00 ቅዳሜ ከ 2፡30 - 6፡00፡፡ የስራ ቦታ ጋርመንት አትክልተራ አካባቢ፡፡  __________________  Private Client  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709044132,
      "link": "https://t.me/freelance_ethio/64533",
      "content": "Job Title: Chief Compliance Officer (CCO)/ Head of Compliance  Job Type: On-site - Permanent (Full-time)  Job Sector: #Accounting_and_finance  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: About the Role: We are seeking a dynamic and experienced Chief Compliance Officer (CCO)/ Head of Compliance to join our team. As the CCO, you will play a crucial role in ensuring our company, a new Capital Market Service Provider, adheres strictly to all applicable laws, regulatory directives, and internal policies. Your leadership will be instrumental in developing and implementing policies designed to ensure compliance and minimize potential losses from non-compliance.  Key Responsibilities: -Oversee and ensure compliance with all relevant legal and regulatory requirements. -Develop, implement, and monitor effective compliance policies and procedures. -Lead risk management initiatives, focusing on operational and regulatory risks. -Keep abreast of, and advise on, changes in the legal and regulatory environment. -Collaborate with different staffs to ensure company-wide compliance. -Conduct regular compliance audits and reviews.  Minimum Qualifications: -A first degree or equivalent in Law(high preference for law), Management, Accounting, or Finance from a recognized institution of higher learning.  Preferred Certifications: -CPA licensing and registration by the pertinent government organ in Ethiopia (advantageous but not compulsory). -CAMS certification from ACAMS or Certified Fraud Examiner from ACFE (considered advantageous).  Minimum Experience: -At least three (3) years' post-graduation experience in risk, control, compliance, law, or equivalent within the financial services industry; or five (5) years' relevant post-graduation experience in the financial services industry.  Technical Skills: -Profound knowledge of Capital Market operations. -Strong understanding of the business operations of a Capital Market Service Provider. -Proficient in risk management (including operational and regulatory risks). -Familiarity with relevant laws, directives, and regulations. -Basic financial analysis skills. -Knowledge of Anti-Money Laundering/Combating the Financing of Terrorism (AML/CFT).  Soft Skills: -Exceptional verbal and written communication skills. -Effective coordination and organizational abilities. -Strong critical analysis and problem-solving skills. -Excellent interpersonal skills. -Proven team management and leadership capabilities. -Meticulous attention to detail.  Application Process: Interested candidates are invited to submit their CV and a cover letter detailing their qualifications, experience and how they can handle the listed responsibilities to capitalproject@mazethiopiatrading.com  __________________  Private Client  2 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709042520,
      "link": "https://t.me/freelance_ethio/64532",
      "content": "Job Title: Securities Trader (Appointed Representative)  Job Type: On-site - Permanent (Full-time)  Job Sector: #Accounting_and_finance  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: About the Role: MAZ Capital is seeking a skilled and experienced Securities Trader to join our team as an Appointed Representative. In this vital role, you will be responsible for executing client instructions/mandates and handling transactions for our proprietary account. This role also requires obtaining an appointed representative license from the authority. As part of this process, the selected candidate will undertake a licensing examination and be interviewed by the authority to ensure full compliance and qualification for the role.  Key Responsibilities: -Execute and manage trading activities based on client instructions. -Implement transactions for the proprietary account of the sponsoring Capital Market Service Provider. -Stay updated on market trends, economic indicators, and other relevant financial news. -Comply with all regulatory guidelines and company policies in trading activities. -Analyze market conditions to make informed trading decisions.  Minimum Qualifications: A first degree or its equivalent in any discipline from a recognized institution of higher learning.  Preferred Certifications: A Level 3 qualification certificate from the Chartered Institute for Securities and Investment (CISI) is preferable. If not currently held, the company is willing to sponsor and pay for the right candidate to obtain this certification.  Minimum Experience: At least three (3) years of post-graduation experience in the financial services industry.  Technical Skills: -Comprehensive knowledge of the workings of the Capital Market and the financial services industry. -Strong understanding of economic indicators and parameters. -Familiarity with relevant laws, directives, and regulations. -Proficient in trading strategies, associated risks, and risk management.  Soft Skills: -Excellent interpersonal skills. -Strong research and analytical skills.  Application Process: Interested candidates are invited to submit their CV and a cover letter detailing their qualifications, experience and how they can handle the listed responsibilities to capitalproject@mazethiopiatrading.com  __________________  Private Client  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709042390,
      "link": "https://t.me/freelance_ethio/64531",
      "content": "Job Title: Graphic Designer  Job Type: On-site - Permanent (Full-time)  Job Sector: #Sales_and_Promotion  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 2  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Our New Company looking for a full time Graphic design and Sales for our business sector, Printing, Stationery Qualifications: - Diploma - Proficient in Adobe Photoshop, Illustrator and advantageous who can work in other graphics design software  - Undertaking daily sales activities - Working on Bid activities  - Good communication skill - At list one year experience - Able to accept other assignments   Salary: Gross 5000 birr + 1000 Transport Location: Bole Olimpia  Note:  - Advantageous who leaves near Bole (Around Denbel City Center)  __________________  Forward Trading PLC [Verified Company ✅]  2 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709040143,
      "link": "https://t.me/freelance_ethio/64530",
      "content": "Job Title: Sales  Job Type: On-site - Permanent (Full-time)  Job Sector: #Sales_and_Promotion  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Vacancies: 1  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: We're looking for a female worker who lives near the area code 22. We need someone friendly with good communication skills and the ability to sell. The job involves keeping the store clean and helping customers. The hours are from 3 AM to 1 AM, and it's a salaried position. If you're interested and can work these hours, we'd love to hear from you!  __________________  Private Client  4 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709038786,
      "link": "https://t.me/freelance_ethio/64529",
      "content": "Job Title: Marketing Assistant  Job Type: On-site - Permanent (Full-time)  Job Sector: #Marketing_and_Advertisement  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Tasks and Responsibilities  - Undertake daily administrative tasks to ensure the functionality and coordination of the Marketing department’s activities - Support marketing executives in organizing various projects - Assist in developing marketing strategies for the company as well as for the several projects it runs - Assist in crafting creative strategies for all marketing activities for both digital and traditional marketing mediums - Assist in overseeing the implementation of the devised marketing and brand strategies by working closely with the members of the marketing department - Make sure all the activities of the marketing team to ensure the timely execution of the expected deliverables  - Assist in ensuring the social media presence of the company and its projects are maintained and up to the set expectations of their respective strategies   - Assist in conducting market research studies to identify opportunities to ensure market visibility, reach new market segments, and expand market share - Ensure our brand message is strong and consistent across all channels and marketing efforts (like on social media, email campaigns, and on-ground presence) - Perform simple designs and edits, create content calendars, actively engage in digital marketing and social media activities, stay updated on current marketing trends, and integrate them into the plans. Additionally, contribute to report preparation and analytics. - Design and edit visually appealing materials for various marketing collateral, ensuring alignment with brand guidelines and campaign requirements using simple editing tools. - Develop and maintain a content calendar outlining the schedule for marketing initiatives. - Actively participate in digital marketing campaigns across multiple platforms and engage with the audience on social media channels, responding to comments and messages. - Assist in gathering and analyzing data relevant to marketing performance, contributing insights to the preparation of comprehensive marketing reports. - Utilize analytics tools to measure the effectiveness of marketing strategies and interpret data to provide actionable recommendations for optimization.  Job Requirements  - BA in Marketing or relevant field of study - Proven work experience in the marketing field - Experience in social media management and email marketing  - Knowledge and experience in running successful marketing campaigns - Working knowledge of web analytics, Google AdWords & digital marketing analytics as a whole - Excellent verbal and written communication skills - Demonstrable ability to multitask and adhere to deadlines - Keeping up to date with current industry trends and tools  __________________  iCog Anyone Can Code [Verified Company ✅]  27 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709037986,
      "link": "https://t.me/freelance_ethio/64528",
      "content": "Job Title: Sales Agent  Job Type: On-site - Permanent (Full-time)  Job Sector: #Sales_and_Promotion  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: The job is to promote, Negotiate and sell our clothing products to the boutique, wholesalers and other stakeholders by our own price with commission  and constant monthly salary.  __________________  Haleta Clothings [Verified Licensed Startup 🚀]  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709036727,
      "link": "https://t.me/freelance_ethio/64527",
      "content": "Job Title: Female tutor for grade 4, 5 and 9  Job Type: Remote - Part-time  Job Sector: #Teaching_and_Tutor  Work Location: Addis Ababa, Ethiopia  Experience Level: Expert  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: The client must meet the following requirements.  1, The client must be female And FLUENT IN OROMIFA  2, Must be highly Knowledgeable in the subject   3, Available on all weekdays  4, Must have 2 years Of experience in tutoring;  5, LOCATION _    1, ASHEWA MEDA    NOTE_  if you dont fullfill the above requirements Please don't apply !!!!!!!  __________________  Brainmetron Tuition Center [Verified Company ✅]  15 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709036639,
      "link": "https://t.me/freelance_ethio/64526",
      "content": "Job Title: Network Instructor  Job Type: On-site - Contractual  Job Sector: #Software_design_and_Development  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 1  Salary/Compensation: Fixed (One-time)  Deadline: 11/3/2024  Description: Have a comprehensive understanding of of networking networking into the course This'll include delving into the OSINT model, effective problem troubleshooting strategies, a explanation on how DHCP works, and a clear distinction between the roles and functionalities of switches and routers.  You can follow CCNA Exam program to help you have a vision on the rights topics to teach. Additionally, there will be sessions on Windows OS maintenance and updates, along with fundamental Excel skills These supplementary topics will help the staffs to be more effective on day to day job with the Office suite  Requirements  - BSc degree in computer science , CISCO and Comp A+ certificate is preferable  -send us your cv and cover letter stating why you are the right candidate only at: @Merahyanofficial  __________________  Merahyan Training Center [Verified Company ✅]  15 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709036586,
      "link": "https://t.me/freelance_ethio/64525",
      "content": "Job Title: Junior General Accountant  Job Type: On-site - Permanent (Full-time)  Job Sector: #Manufacturing_and_production  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Vacancies: 4  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: posting journal entries, updating financial statements, maintaining accounts receivable and accounts payable, paying monthly payroll, and preparing financial reports.Graduate's of 2023/2024 with CGPA 3.0 or More  __________________  Feda Wak PLC (Gold Bottled water and non - alcohol manufacturing PLC) [Verified Company ✅]  4 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709036577,
      "link": "https://t.me/freelance_ethio/64524",
      "content": "Job Title: Motorist  Job Type: Remote - Permanent (Full-time)  Job Sector: #Manufacturing_and_production  Work Location: from Anywhere/remote in Ethiopia  Experience Level: Intermediate  Vacancies: 1  Applicants Needed: Male  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Receive and deliver companies important messages from governmental and private sectors  __________________  Feda Wak PLC (Gold Bottled water and non - alcohol manufacturing PLC) [Verified Company ✅]  3 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709036571,
      "link": "https://t.me/freelance_ethio/64523",
      "content": "Job Title: Senior Blowing Machine Operator  Job Type: On-site - Permanent (Full-time)  Job Sector: #Manufacturing_and_production  Work Location: Others, Ethiopia  Experience Level: Senior  Vacancies: 2  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Mainly operate the Blowing machine regularly Keep the safety and neatness of the machine daily  Follow the rules and regulations of the company  Receive and achieve orders set by his superior  __________________  Feda Wak PLC (Gold Bottled water and non - alcohol manufacturing PLC) [Verified Company ✅]  2 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709036566,
      "link": "https://t.me/freelance_ethio/64522",
      "content": "Job Title: የህንፃ ጥበቃ  Job Type: On-site - Permanent (Full-time)  Job Sector: #Security_and_Safety  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 14  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: ድርጅታችን ብቁ የሆኑ የጥበቃ ሰራተኞች መቅጠር ይፈልጋል። በተለያዩ ድርጅቶች ወይም የመኖሪያ አካባቢ ላይ በ24 ሰዓት ወይም 12 ሰዓት ሺፍት ይሰራሉ።   መስፈርት:- ጤናማ የሆነ ሙሉ ቁመና: የስራ ልምድ ማቅረብ የሚችሉ ከፖሊስ ወይም መከላከያ የተሰናበቱ ቢሆኑ ይመረጣል፡፡  እድሜ 21- 48 ፡ከወንጀል ነፃ መሆናቸውን ማስረጃ ማቅረብ የሚችሉ ፡ዋስ ማቅረብ የሚችሉ (የዋስትና ደብዳቤ ማፃፍ የሚችሉ)  ስልክ 0925963636  __________________  Hulum Incorporated Technology Solution Share Company [Verified Company ✅]  3 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709035205,
      "link": "https://t.me/freelance_ethio/64521",
      "content": "Job Title: Senior Filler machine Operator  Job Type: On-site - Permanent (Full-time)  Job Sector: #Manufacturing_and_production  Work Location: Others, Ethiopia  Experience Level: Senior  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Mainly operate the machine regularly Keep the safety and cleanness of the machine daily  Follow the rules and regulations of the company  Receive and achieve orders set by his superior  __________________  Feda Wak PLC (Gold Bottled water and non - alcohol manufacturing PLC) [Verified Company ✅]  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709034911,
      "link": "https://t.me/freelance_ethio/64520",
      "content": "Job Title: ቪዲዮ ኤዲተር  Job Type: Remote - Part-time  Job Sector: #Media_and_communication  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Salary/Compensation: Hourly  Deadline: 12/3/2024  Description: ድርጅታችን ላሉት የዲጂታል ሚዲያዎች ባለበት ቦታ መስራት የምትችል/ችል ጎበዝ ቪዲዮ ኤዲተር ይፈልጋል::    ⁃ የራሱ/ሷ ኮምፒውተር እና የኢንተርኔት አገልግሎት ያለው/ላት ⁃ በሳምንት እስከ 4 (በአማካኝ 10 ደቂቃ የሚሆኑ) ቪዲዮዎን መስራት የሚችሉ  ⁃ ክፍያ: በቪዲዮ 250 ብር   NB: አመልካቾች ከዚህ በፊት ከሰራችሃቸው ስራዎች ውስጥ የተወሰኑትን ብቻ ሊንክ በመላክ ያመልክቱ  __________________  Tamela Advertising PLC [Verified Company ✅]  14 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709033902,
      "link": "https://t.me/freelance_ethio/64519",
      "content": "Job Title: Accountant  Job Type: On-site - Permanent (Full-time)  Job Sector: #Accounting_and_finance  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Assist in daily financial transactions, including accounts payable and receivable. Record and reconcile financial data, ensuring accuracy and compliance with accounting principles. Support the preparation of financial statements and reports. Collaborate with senior accountants to ensure timely and accurate month-end and year-end closings. Assist in auditing financial processes and documentation. Maintain organized financial records and files. Handle basic bookkeeping tasks and data entry.  __________________  Office Mart Trading PLC [Verified Company ✅]  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709033711,
      "link": "https://t.me/freelance_ethio/64518",
      "content": "Job Title: Garment Worker/Sifet serategna  Job Type: On-site - Permanent (Full-time)  Job Sector: #Clothing_and_Textile  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 2  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: የጋርመንት ዲጂታል ማሽኖች ላይ ሰርታ የምታቅ  በተሰጠው ልኬት መሰረት አስተካክሎ መቁረጥ የምትችል  በቀን ውስጥ በብዛት ምርት ስለሚወጣ ቀልጣፋ እና ንቁ የሆነች  __________________  Private Client  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709033569,
      "link": "https://t.me/freelance_ethio/64517",
      "content": "Job Title: Liaison Officer  Job Type: On-site - Permanent (Full-time)  Job Sector: #Secretarial_and_office_management  Work Location: Bishoftu, Ethiopia  Experience Level: Junior  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Job Description: Our Organization Korea International Volunteer Organization would like to hire Liaison Officer for its upcoming project working on enhancing quality of education in primary schools.  Key Responsibilities: ~Support project activities deliverables   ~Organize events in collaboration with team and schools  ~Organize documentations and recordings Qualifications: Time sufficient Well communicator Fast learner Ability to work independently  Strong proficiency in English, both written and spoken. Affan oromo speaker is highly preferable  Responsible and fast-paced Requirements: 0-1 years of experience in administrative and related position   BA degree in Management and related fields.   NGO experience is a plus Volunteer experience is a plus  Microsoft office literate  __________________  Korea International Volunteer organization (KVO International) [Verified Company ✅]  7 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709032917,
      "link": "https://t.me/freelance_ethio/64516",
      "content": "Job Title: Project Operation Officer-G.1  Job Type: On-site - Permanent (Full-time)  Job Sector: #Project_management_and_administration  Work Location: Bishoftu, Ethiopia  Experience Level: Intermediate  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Job Description: Our Organization Korea International Volunteer Organization would like to Project Operation Officer-Grade 1 for its upcoming project working on enhancing quality of education in primary schools.  Key Responsibilities: ~Manage project beneficiaries profile  ~Plan project activities and deliverables    ~Organize project activity events, facilitate and report.  ~Provide training and workshop sessions to beneficiary children on various aspects  ~Organize project support deliverable timely  Qualifications: Highly organized Time sufficient Well communicator Fast learner Ability to work independently  Strong proficiency in English, both written and spoken. Affan oromo speaker is highly preferable  Responsible and fast-paced Able to scale-up performance of the department  Requirements: 2-3 years’ experience in medical or humanitarian sector  BA degree in nursing, Health work or related fields  NGO experience is a plus Experience in working with children  Volunteer experience is a plus  Microsoft office literate  __________________  Korea International Volunteer organization (KVO International) [Verified Company ✅]  6 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709032083,
      "link": "https://t.me/freelance_ethio/64515",
      "content": "Job Title: Project Operation Officer-G.2  Job Type: On-site - Permanent (Full-time)  Job Sector: #Research_and_data_Analytics  Work Location: Bishoftu, Ethiopia  Experience Level: Intermediate  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Job Description: Our Organization Korea International Volunteer Organization would like to Project Operation Officer-Grade 2 for its upcoming project working on enhancing quality of education in primary schools.  Key Responsibilities: ~Mange project performance timely  ~Collect timely data and assessment survey to compile project impact and performance result ~Follow up school’s timeline and report  ~Organize timely monitoring and evaluation sessions  Qualifications: Highly organized Time sufficient Well communicator Fast learner Ability to work independently  Strong proficiency in English, both written and spoken. Affan oromo speaker is highly preferable  Responsible and fast-paced Able to scale-up performance of the department  Requirements: 2-3 years of experience in M & E department  BA degree in Management, Statistics, Economics or related fields.  NGO experience is a plus Experience in working with education based projects  Volunteer experience is a plus  Microsoft office literate  __________________  Korea International Volunteer organization (KVO International) [Verified Company ✅]  5 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709031903,
      "link": "https://t.me/freelance_ethio/64514",
      "content": "Job Title: Realestate sales consultant  Job Type: On-site - Permanent (Full-time)  Job Sector: #Sales_and_Promotion  Work Location: Addis Ababa, Ethiopia  Experience Level: Expert  Vacancies: 20  Salary/Compensation: 10000 ETB Monthly  Deadline: 12/3/2024  Description: We are seeking a capable, ambitious, energetic real estate agent to join our growing network of local sales agents. You must be organized, committed, and passionate about helping others find the property of their dreams. Familiarity with local real estate markets is a must. Real Estate Duties and Responsibilities -Facilitate and enable clients to purchase, rent, and sell properties for a fair price -Actively source new clientele through marketing and advertising initiatives -Set appointments to meet with clients and show them prospective properties -Guide clients through properties of interest and emphasize the features and benefits  __________________  Paradise consulting and commission buissness [Verified Company ✅]  11 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709031737,
      "link": "https://t.me/freelance_ethio/64512",
      "content": "Job Title: Procurement and Finance Officer (Internal/external)  Job Type: On-site - Permanent (Full-time)  Job Sector: #Accounting_and_finance  Work Location: Bishoftu, Ethiopia  Experience Level: Intermediate  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Job Description: Our Organization Korea International Volunteer Organization would like to hire Procurement and Finance Officer. Key Responsibilities: ~Mange day to day financial transactions of the projects ~Compile and report monthly donor based financial reports   ~Assist financial system recording and documentation  ~ Ensure timely payments are coordinated and processed timely  ~Facilitate procurement procedures timely and manage deliverables  Qualifications: Highly organized Time sufficient Well communicator Fast learner Ability to work independently  Strong proficiency in English, both written and spoken. Affan oromo speaker is highly preferable  Responsible and fast-paced Able to scale-up performance of the department  Requirements: Minimum of 2 years of experience in finance department  BA degree in Accounting, Management, Economics or related field  NGO experience is highly preferred  Experience in donor based financial reporting  Microsoft office literate  __________________  Korea International Volunteer organization (KVO International) [Verified Company ✅]  3 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709031727,
      "link": "https://t.me/freelance_ethio/64511",
      "content": "Job Title: Senior Accountant (Internal/external)  Job Type: On-site - Permanent (Full-time)  Job Sector: #Accounting_and_finance  Work Location: Bishoftu, Ethiopia  Experience Level: Senior  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Job Description: Our Organization Korea International Volunteer Organization would like to hire Senior Accountant. Key Responsibilities: ~Mange day to day financial transactions of the projects ~Plan and facilities quarterly financial plan  ~Evaluate budget performance and report timely  ~Mange government timely payments and process accordingly  ~ Oversee project financial monthly, quarterly and annual report deliverables ~Mange financial system recording and documentation  ~ Ensure timely payments are coordinated and processed timely  ~Mange procurement procedures Qualifications: Highly organized Time sufficient Well communicator Fast learner Ability to work independently  Strong proficiency in English, both written and spoken. Affan oromo speaker is highly preferable  Responsible and fast-paced Able to scale-up performance of the department  Requirements: Minimum of 5 years of experience in finance department  BA degree or Masters in Accounting, Management, Economics or related field  NGO experience is highly preferred  Experience in usage latest financial systems Microsoft office literate  __________________  Korea International Volunteer organization (KVO International) [Verified Company ✅]  2 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709031713,
      "link": "https://t.me/freelance_ethio/64510",
      "content": "Job Title: Operations Assistant  Job Type: On-site - Permanent (Full-time)  Job Sector: #Secretarial_and_office_management  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Vacancies: 1  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Operations Assistant responsibilities but not limited to the following 1. Assisting the manager with day to day operational issues. 2. Taking trips to private and public offices to represent the company on essential business activities 3. Scheduling meetings and teams building sessions as required 4. Providing excellent customer services and maintaining relationships with vendors 5. Acting as the point of contact between the executives and internal or external colleagues 6. Preparing and filing forms and other documents 7. Assisting the recruitment and onboarding processes 8. Taking inventory and ordering office supplies as needed  Please use the link to apply for the job: https://forms.gle/cRoPARvzce86ajf39  __________________  KINET ICT PLC [Verified Company ✅]  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709031450,
      "link": "https://t.me/freelance_ethio/64509",
      "content": "Job Title: Sales position for healthcare  Job Type: On-site - Part-time  Job Sector: #Health_care  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Vacancies: 20  Salary/Compensation: Fixed (One-time)  Deadline: 12/3/2024  Description: Our company would like to hire interested health professionals in marketing position.  Duties include representing our company and securing partnership, advertisement, customer service/care, and related jobs. Candidates may not be working or may be currently working in a healthcare center. Applicants should be available for interviews and training. Salary/compensation will be commission based.  __________________  TechMed Healthcare Services PLC [Verified Licensed Startup 🚀]  6 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709030521,
      "link": "https://t.me/freelance_ethio/64508",
      "content": "Job Title: Backend Developer  Job Type: On-site - Permanent (Full-time)  Job Sector: #Software_design_and_Development  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 2  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: About Us: Join Technolab, where innovation meets excellence. We seek a skilled Backend Developer with a knack for Node.js/NestJs, API craftsmanship, and a passion for building scalable solutions.  Responsibilities: - Develop robust API solutions with Node.js. - Collaborate for enhanced application performance. - Implement security, data protection, and database integration. - Monitor and optimize web services. - Stay updated with new technologies.  Qualifications: - Bachelor’s in Computer Science or related field. - Proven Node.js/NestJs expertise. - Solid understanding of JavaScript, RESTful APIs, and database systems. - Familiar with front-end technologies, cloud services, and CI/CD pipelines. - Excellent problem-solving skills.  What We Offer: - Competitive salary and benefits. - Professional growth in a supportive environment.  Apply Now: Submit your Resume, Cover Letter highlighting your Node.js/NestJS and API experience, Portfolio. Incomplete applications will be automatically rejected. Note: Speed is cirtical matter with us , if you cant comply to this , we suggest not to consider this opportunity.  __________________  Technolab LLC [Verified Company ✅]  7 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709030515,
      "link": "https://t.me/freelance_ethio/64507",
      "content": "Job Title: Front end Developer (React Js)  Job Type: On-site - Permanent (Full-time)  Job Sector: #Software_design_and_Development  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Company Overview: At Technolab, we're at the forefront of creating cutting-edge web and mobile experiences. We're currently on the lookout for a talented Front End Developer with a deep understanding of React.js, ready to push the boundaries of what's possible on the web.  Key Responsibilities: - Develop and maintain web applications using React.js, Next.js, and TypeScript. - Implement robust state management solutions to ensure efficient data flow and reactivity across applications. - Integrate third-party APIs seamlessly while maintaining performance and scalability. - Work closely with the backend team to ensure APIs are integrated efficiently. - Utilize React Native for the development of cross-platform mobile applications, ensuring consistency and performance across devices. - Collaborate with designers and product managers to refine and implement innovative UI/UX designs. - Optimize applications for maximum speed and scalability. - Adhere to best coding practices and standards, including code reviews and testing.  Requirements: - Bachelor’s degree in Computer Science, Software Engineering, or related field. - Proven experience as a Front End Developer with a strong portfolio in React.js projects. - Expertise in state management libraries (e.g., Redux, MobX), TypeScript, and Next.js. - Experience with API integration and managing cross-origin resource sharing (CORS) issues. - Familiarity with React Native and the development of cross-platform mobile applications. - Solid understanding of responsive design and development practices. - Excellent problem-solving skills and attention to detail. - Strong communication and teamwork abilities.  What We Offer: - Competitive salary and benefits package. - Opportunities for professional development in a dynamic, innovative environment. - A collaborative team culture that values each member’s contribution.  How to Apply: Interested candidates should send a Resume/CV and Cover Letter highlighting experience in React.js, state management, TypeScript, Next.js, API integration, and React Native, along with a portfolio of relevant projects.  Note: Only candidates who meet the qualifications and provide a complete application will be considered. Speed is a very critical element with us , if you cant comply to this , we suggest not to consider this opportunity.  __________________  Technolab LLC [Verified Company ✅]  6 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709027286,
      "link": "https://t.me/freelance_ethio/64506",
      "content": "Job Title: Full Stack Python Engineer  Job Type: On-site - Contractual  Job Sector: #Software_design_and_Development  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: We are seeking a highly skilled and motivated Full Stack Python Developer to join our development team. As a Full Stack Python Developer, you will be responsible for designing and implementing web applications, both front-end and back-end, using Python programming language and related technologies. You will collaborate with cross-functional teams to deliver high-quality, scalable, and efficient software solutions. The ideal candidate should have a strong background in Python development, web frameworks, database management, and experience with data science, machine learning, AI, and task automation. Role and Responsibilities: - Develop and maintain web applications using Python frameworks such as Django, Flask. - Design and implement robust, scalable, and secure server-side components and APIs.  - Create responsive and user-friendly front-end interfaces using HTML, CSS, and JavaScript frameworks like React, Angular, or Vue.js.  - Collaborate with designers, product managers, and other team members to gather requirements and translate them into technical specifications.  - Participate in the entire software development life cycle, including planning, coding, testing, and deployment.  - Optimize applications for maximum performance, scalability, and maintainability.  - Conduct code reviews to ensure code quality, adherence to coding standards, and best practices.  - Identify and troubleshoot issues, bugs, and performance bottlenecks, and provide timely resolutions. - Integrate data science and machine learning models into web applications, leveraging Python libraries such as NumPy, Pandas, scikit-learn, or TensorFlow.  - Implement AI algorithms and techniques to enhance application functionality and user experience.  - Automate repetitive tasks and processes using Python scripting or task automation frameworks. Preferred Skills:  -Experience with cloud platforms such as AWS, Azure, or Google Cloud.  -Knowledge of NoSQL databases like PostgreSQL, MongoDB or Redis.  -Familiarity with containerization technologies like Docker.  -Understanding of Agile/Scrum methodologies.  -Familiarity with version control systems (e.g., Git) and collaborative development workflows. -Knowledge of software testing and continuous integration/continuous deployment (CI/CD) practices. -Solid understanding of web development concepts, including RESTful APIs, HTTP, and JSON.  Qualifications:  - Bachelor's degree in Computer Science, Software Engineering, or a related field.  - Proven 3-4 years of experience as a Full Stack Developer with a focus on Python development.  __________________  Private Client  10 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709026233,
      "link": "https://t.me/freelance_ethio/64505",
      "content": "Job Title: የቲኬት ሻጭ  Job Type: Remote - Part-time  Job Sector: #Food_and_Drink_preparation_or_service  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Salary/Compensation: Fixed (One-time)  Deadline: 12/3/2024  Description: በምግብ ቤታችን ለትንሣኤ በዓል የተዘጋጀ ዕጣ የሚሸጥ ጥሩ ተግባቦት ያለው/ያላት የኮሚሽን ሠራተኛ እንፈልጋለን።  - ፈጣን እና የተግባቦት አቅም ያለው/ያላት። - መታወቅያ ወይም ፓስፖርት ወይም ዲግሪ ማስያዝ የሚችል /የምትችል። -ለሥራው ፋላጎት ያለው ያላት።  __________________  ቤተ አብርሃም ማዕድ [Verified Company ✅]  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709024538,
      "link": "https://t.me/freelance_ethio/64504",
      "content": "Job Title: የንግድ ሱቅ ተቆጣጣሪ  Job Type: On-site - Permanent (Full-time)  Job Sector: #Accounting_and_finance  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: የኮንስትራክሽን ማተርያል መሸጫ ለሆነው ሱቃችን ልምድ ያላት ሱቅ ተቆጣጣሪ እንፈልጋለን   - የንግድ ሱቅ በአግባቡ መቆጣጠር  የምትችል  - ካሽ ሬጅስተር ማሽን መጠቀም የምትችል - የእጅ በእጅ እና ሌሎች ደረሰኞችን መቁረጥ የምትችል - ኮምፕዩተር (Word, excel..) እና ስማርት ፎን መጠቀም የምትችል - tax declaration (ታክስ እወጃ) ማዘጋጀት የምትችል  - ፈጣን እና ከሰው ጋር ተግባቢ የሆነች  የስራ ሰዓት  ከሰኞ እስከ ቅዳሜ ከጠዋት 2:00 አስከ ማታ 11:00   የስራ ቦታ:  አዲስ አበባ ሲግናል አካባቢ   ደሞዝ:  በስምምነት  መስፈርቱን የምታሟላ ልምድ ያላት ሴት አመልካች ማመልከት ትችላለች  __________________  Private Client  4 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709023893,
      "link": "https://t.me/freelance_ethio/64503",
      "content": "Job Title: Cafe Operational Manager  Job Type: On-site - Permanent (Full-time)  Job Sector: #Project_management_and_administration  Work Location: Addis Ababa, Ethiopia  Experience Level: Expert  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: He/She is in charge of strategic planning and overseeing a cafe's daily operations. In order to boost profitability and customer’s engagement, she manages workers, makes sure that exceptional customer service is provided, handles ordering and inventory, and keeps track of financial records.  Responsibilities :-  • Overseeing the cafe's daily operations; hiring and orienting new employees instructing personnel on how to make drinks and utilize coffee makers. • Develop cordial connections with customers in order to foster loyalty and improve our standing. • Ensure availability of adequate inputs on stock,(such as food packing material, coffee, milk etc.) ensure daily, weekly and monthly revenue and cost records are kept up to date. • Depending on the season and the tastes of the patrons, introduce new menu items (food, juice, coffee drinks, for example). • Provide employees with guidance on how to provide exceptional customer service and handle complaints if any • Other assignments as required by the managing director.  Experience :-  • Having experience of working as an operation or cafe manager. • Practical knowledge of cafe and coffee shop businesses with strong analytical and coordination abilities. • Willingness to work on weekends and holidays. • Outstanding interpersonal skill and the capacity to lead and inspire a group. • Customer-focused mindset.  Education and Training :-  • BA in management, hospitality, or other     related fields with 5 (five)  years of experience as mentioned above. • A second certification is preferable, such as one in hospitality or business administration.   Qualified woman between the age of 25 and 35 years are encouraged.  __________________  ETHIO-ARABICA TRADING PLC [Verified Company ✅]  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709023288,
      "link": "https://t.me/freelance_ethio/64502",
      "content": "Job Title: Junior Accountant  Job Type: On-site - Permanent (Full-time)  Job Sector: #Accounting_and_finance  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: We are looking for a detail-oriented Junior Accountant with at least 1 year of experience in payroll processing and online payroll posting. Experience with Peachtree accounting software is a plus. The ideal candidate should possess strong analytical skills, have a solid understanding of accounting principles, and be proficient in Microsoft Excel.  Responsibilities: - Process and post payroll data accurately and in a timely manner - Ensure compliance with relevant payroll laws and regulations - Assist in preparing financial reports, including balance sheets, income statements, and cash flow statements - Reconcile accounts and resolve discrepancies - Assist in month-end and year-end closing processes - Perform general accounting tasks as needed - Collaborate with team members to support overall department goals  Requirements: - Bachelor’s degree in Accounting, Finance, or related field - At least 1 year of experience in payroll processing and online payroll posting - Proficiency in Microsoft Excel - Experience with Peachtree accounting software is a plus - Strong attention to detail and accuracy - Excellent communication and interpersonal skills - Ability to work efficiently both independently and in a team environment   to apply use this link https://forms.gle/ZC7EXtscz3APhCKG7  __________________  A.R.S [Verified Licensed Startup 🚀]  87 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709022941,
      "link": "https://t.me/freelance_ethio/64501",
      "content": "Job Title: English language teacher  Job Type: On-site - Permanent (Full-time)  Job Sector: #Teaching_and_Tutor  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: We are hiring english language teachers for our language center located in Addis Ababa . Candidates are required to prepare and assess student to better their english language. The job requires dedication and hard work to perform at the highest level possible. Working days are from Monday to Saturday with a gross salary of 21500. Candidates who are energetic and are eager to work for the betterment of the students are welcomed to apply .  __________________  Language training center [Verified Licensed Startup 🚀]  23 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709022440,
      "link": "https://t.me/freelance_ethio/64500",
      "content": "Job Title: Video editor  Job Type: On-site - Permanent (Full-time)  Job Sector: #Teaching_and_Tutor  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: We are hiring video editor  for our language centers located in Addis Ababa.candinates  are expected to perform duties that are assigned by the company and work coordinately with their coworkers to achieve company’s goal. Cadinates are expected to have excellent video editing skill . Salary is negotiable.  __________________  Mh Language and computer training [Verified Company ✅]  20 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709022407,
      "link": "https://t.me/freelance_ethio/64499",
      "content": "Job Title: Outdoor commission sales  Job Type: Remote - Contractual  Job Sector: #Sales_and_Promotion  Work Location: from Anywhere/remote  Experience Level: Junior  Vacancies: 10  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Job Opportunity: Outdoor Commission Sales Representative   Position Type: Commission-based  Description: Are you a dynamic, self-motivated individual with a passion for sales? Join our team as an Outdoor Commission Sales Representative! We specialize in providing cutting-edge digital marketing solutions to businesses, and we're seeking enthusiastic individuals to help drive our growth.  Responsibilities: - Identify and approach potential clients in outdoor settings such as business districts, events, and networking functions. - Present our digital marketing services and solutions to prospective clients. - Build and maintain relationships with clients, providing excellent customer service throughout the sales process. - Meet and exceed sales targets and goals set by the company.  Requirements: - Proven experience in sales, preferably in a commission-based role. - Excellent communication and interpersonal skills. - Ability to work independently and manage time effectively. - Knowledge of digital marketing concepts and trends is a plus. - willing to travel within the designated sales territory.  Benefits: -transport allowance  - Competitive commission structure with unlimited earning potential. - Flexible schedule, allowing for autonomy and work-life balance. - Opportunity for growth and advancement within the company. - Training and support provided to help you succeed in your role.  How to Apply: If you're ready to take your sales career to the next level, please send your resume and to @m1ckey44. Be sure to include \"Outdoor Commission Sales Representative\" in the subject line.  __________________  veljet trading [Verified Company ✅]  2 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709021680,
      "link": "https://t.me/freelance_ethio/64498",
      "content": "Job Title: Training Coordinator  Job Type: On-site - Permanent (Full-time)  Job Sector: #Training_and_Mentorship  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: We're seeking a highly motivated and dynamic Training Coordinator to join our organization. As a Training Coordinator, you will be responsible for coordinating and facilitating training programs to enhance the skills and knowledge of our employees. The ideal candidate will be fluent in English, possess excellent public speaking skills, and have a strong background in training coordination.  Responsibilities:  -Coordinate and facilitate training programs to meet the organization's learning and development objectives. -Conduct engaging training sessions, workshops, and presentations, utilizing effective instructional techniques and public speaking skills. -Collaborate with various departments to identify training needs and develop comprehensive training plans. -Assist in the development and modification of training materials, ensuring their relevance and alignment with organizational goals. -Manage training logistics, including scheduling, venue reservations, equipment setup, and participant registrations. -Collect feedback and evaluate the effectiveness of training programs, making recommendations for improvement. -Maintain accurate records of training activities, participant lists, and training program schedules. -Support trainers and participants during training events, addressing questions and concerns. -Stay updated on industry trends and best practices in training and development.  Requirements:  -Fluent in English, with excellent verbal and written communication skills. -Confident public speaker with the ability to deliver engaging presentations and workshops. -Previous experience in training coordination, instructional design, or related roles would be a plus. -Strong organizational and multitasking abilities to manage multiple training programs and schedules. -Proficiency in using training software, learning management systems, and multimedia tools. -Excellent interpersonal skills to build relationships with participants, trainers, and stakeholders. -Ability to work collaboratively in a team environment and communicate effectively at all levels of the organization.  If you are passionate about learning and development, possess outstanding communication skills, and have a strong background in training coordination, we welcome your application. Join our team and contribute to the growth and success of our organization through effective training initiatives.  __________________  MODETH Outsource P.L.C [Verified Company ✅]  81 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709020018,
      "link": "https://t.me/freelance_ethio/64496",
      "content": "Job Title: Receptionist  Job Type: On-site - Permanent (Full-time)  Job Sector: #Shop_and_Office_attendant  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Vacancies: 1  Applicants Needed: Female  Salary/Compensation: 4000 ETB Monthly  Deadline: 12/3/2024  Description: This person would be required to clean the office. (Cleaning Experience prefered) -Client / Guest reception and making tea or coffee. -Printing materials and purchasing other things. -Apply only if you live near to kera(Gofa)   Office hours are M-S from 8am-6pm  __________________  Private Client  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709019201,
      "link": "https://t.me/freelance_ethio/64495",
      "content": "Job Title: Marketing Specialist  Job Type: On-site - Permanent (Full-time)  Job Sector: #Marketing_and_Advertisement  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Vacancies: 3  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: - Monitoring the effectiveness of marketing campaigns - Running online marketing and digital marketing campaigns - Writing a marketing report based on completed market research - Collaborating with a marketing agency - Developing marketing plans to meet business goals - Defining the parameters of marketing materials - Working to raise brand awareness - Producing corporate communications - Defining consumer demographics and target customers - Creating brand guidelines Managing paid advertising/search engine marketing (work closely with the SEO manager) - Determining the price of products and services/developing pricing strategies - Liaising with sales teams, Project Managers, and key stakeholders - Proposing creative ideas for marketing campaigns Implementing marketing projects, marketing plans, marketing strategies, and inbound marketing activities Ensuring marketing campaigns remain within the marketing budget - Running digital marketing campaigns and overseeing social media accounts/social media marketing - Providing event management - Conducting market research with target audiences - Analysing marketing and sales data/demographic data - Managing the marketing team (marketing manager responsibilities) or marketing teams (marketing director responsibilities) - Maintaining industry knowledge on market trends and competitive research  __________________  Private Client  6 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709018112,
      "link": "https://t.me/freelance_ethio/64494",
      "content": "Job Title: ባሬስታ  Job Type: On-site - Contractual  Job Sector: #Food_and_Drink_preparation_or_service  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: የስራ መስፈርቶች፡      _ በምግብ ዝግጅት  በመስተንግዶ   ደረጃ 3/4 ዲፕሎማ ወይም  12  ክፍል ተመጣጣኝ      - የቀደመ የ3 አመት የባሪስታ ልምድ የለው      - ልዩ የማዳመጥ እና የመግባባት በፍጥነት የመማር ችሎታ      - ጥዋት እና ማታ፤ ቅዳሜ እና እሁድ በተጨማሪም በዓላትን እና ስራ በሚበዛበት ሰዓታት ለመስራት ፈቃደኝነት      - ጨዋ እና ተግባቢ ባህሪ      - ፍጥነት ባለው የስራ አካባቢ ለመስራት ፈቅደኛ የሆነ   የስራ ሀላፊነቶች፡      - ደንበኞችን ተዕዛዝ መቀበል፤ ስለ ተለያዩ ወይም አዳዲስ እቃዎች ማሳወቅ፤ ጥያቅዎችን መመለስ እና ትዕዛዞችን መቀበል     - ቡና መፍጨት እና ማዘጋጀት፤ የተለያዩ ትኩስ እና  ቀዝቃዛ መጠጦችን  ማዘጋጀት     - የ ስራ፤ መሳሪያችን እና የመመገቢያ ቦታዎችን ማጵዳት እና ማደስ፤ ቆሻሻ ማስወገድ      - ደንበኞችን ለመሳብ አቀራረብን ማሳመር     - ከፍተኛ ሀይል ያለው የቡድን አካል ሆኖ መስራት ለማምልከት ከታችባልወ ሊንክ ይጠቀሙ https://forms.gle/Q8sEYEKYbQJmgWhw5  __________________  Purpose Black Eth Trading s.c [Verified Company ✅]  254 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709017652,
      "link": "https://t.me/freelance_ethio/64493",
      "content": "Job Title: Chabod School is looking for teachers  Job Type: On-site - Permanent (Full-time)  Job Sector: #Teaching_and_Tutor  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: The following are what we are seeking from potential new recruits  1. Graduate from a notable’s university with BA , BED and Bsc  2. A person who is willing to work right away  3.  A committed person that loves to work with kids and in a very tight knitted group  4.we are looking to hire both genders and women are highly encouraged. The salary out is at the range  between 4100 net to 5000 net depending on the selected position  5. Applicants should be excellent in English in spoken, listening and reading.  6. As our work location is around Kera , applicants are preferred to be residing close by  __________________  CHABOD SCHOOL [Verified Company ✅]  20 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709017588,
      "link": "https://t.me/freelance_ethio/64492",
      "content": "Job Title: Male tutor grade 8  Job Type: Remote - Part-time  Job Sector: #Teaching_and_Tutor  Work Location: Addis Ababa, Ethiopia  Experience Level: Expert  Applicants Needed: Male  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: The client must meet the following requirements.  1, The client must be male  2, Must be highly Knowledgeable in the subject   3, Available on TUESDAY, WEDNESDAY and THURSDAY   4, Must have 2 years Of experience in tutoring;  5, LOCATION _    1, 4 KILO    NOTE_  if you dont fullfill the above requirements Please don't apply !!!!!!!  __________________  Brainmetron Tuition Center [Verified Company ✅]  14 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709017385,
      "link": "https://t.me/freelance_ethio/64491",
      "content": "Job Title: Graphics designer  Job Type: On-site - Permanent (Full-time)  Job Sector: #Creative_art_and_design  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Are you a creative wizard with a passion for visual storytelling? Join our team as a Graphics Designer and let your imagination soar!  Role Overview: As a Graphics Designer, you will be responsible for conceptualizing and creating captivating designs that bring our brand to life across various platforms. From eye-catching social media graphics to stunning website visuals, you'll play a pivotal role in shaping our visual identity.  Key Responsibilities - Develop visually engaging designs for digital and print materials, including social media posts, website banners, advertisements, and marketing collateral. - Collaborate with the marketing team to translate concepts and ideas into compelling visual assets that resonate with our target audience. - Maintain brand consistency and integrity across all design projects. - Stay up-to-date with industry trends and best practices to ensure our designs remain fresh and innovative.  Requirements - Proven experience as a graphics designer or similar role. - Proficiency in design software such as Adobe Photoshop, Illustrator, and InDesign. - A strong portfolio showcasing your creative work and design skills. - Excellent attention to detail and a keen eye for aesthetics. - Effective communication and collaboration skills. - Ability to work efficiently under tight deadlines.  Preferred Qualifications - Experience with motion graphics and video editing software is a plus. - Familiarity with UX/UI design principles.  __________________  veljet trading [Verified Company ✅]  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709016740,
      "link": "https://t.me/freelance_ethio/64490",
      "content": "Job Title: Oromifa script translator and editor  Job Type: On-site - Permanent (Full-time)  Job Sector: #Translation_and_Transcription  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Job Description:  We are seeking a skilled and experienced translator and editor proficient in translating content from Amharic and English to Oromifa script.   As a translator and editor, your primary responsibility will be to accurately translate and edit various texts, documents, and materials from both Amharic and English into Oromifa script.   This position requires a deep understanding of both languages and cultures, as well as proficiency in writing and editing.  Responsibilities:  Translate written content from Amharic and English to Oromifa script while maintaining the original meaning, tone, and context.  Edit and proofread translated materials to ensure accuracy, clarity, and consistency.Collaborate with other translators, editors, and project managers to meet deadlines and quality standards.  Conduct research as needed to ensure the accuracy and relevance of translations, especially in specialized fields.  Adapt translations to fit the cultural nuances and linguistic conventions of the Oromifa-speaking audience.  Handle confidential and sensitive information with integrity and discretion.  Requirements:  Proficiency in both Amharic and English languages, including reading, writing, and speaking.  Fluency in Oromifa script with the ability to accurately translate and edit content.  Strong attention to detail and excellent grammar, spelling, and punctuation skills.   Bachelor’s degree in Any field.  __________________  Private Client  3 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709016528,
      "link": "https://t.me/freelance_ethio/64489",
      "content": "Job Title: Customer Service Representative  Job Type: On-site - Permanent (Full-time)  Job Sector: #Sales_and_Promotion  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Vacancies: 6  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: We are seeking a Customer Service Representative to join our team. The ideal candidate should have excellent communication skills, be customer-oriented, and able to handle inquiries and resolve issues effectively. Responsibilities include responding to customer inquiries via phone and chat, providing information about services, and ensuring customer satisfaction. Previous customer service experience is preferred.  __________________  IN AFRICA TOGETHER [Verified Company ✅]  46 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709015858,
      "link": "https://t.me/freelance_ethio/64488",
      "content": "Job Title: Graphic designing and social media management  Job Type: On-site - Contractual  Job Sector: #Information_technology  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Designing the company logo, branding, head letter, creating and managing the company social medias.  __________________  Springfield Education and Social Affairs training and consultancy PLC [Verified Company ✅]  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709012902,
      "link": "https://t.me/freelance_ethio/64487",
      "content": "Job Title: Graphics Design Instructor  Job Type: On-site - Part-time  Job Sector: #Creative_art_and_design  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: We are looking for a passionate and experienced Graphics Design Instructor to join our team. The ideal candidate will have a solid background in graphics design along with a proven track record of teaching and mentoring individuals in this field. As a Graphics Design Instructor, you will be responsible for developing and delivering high-quality instructional materials, conducting engaging classes, and providing valuable feedback to students to help them enhance their skills and reach their full potential.  Responsibilities:  - Develop and deliver comprehensive graphics design curriculum that aligns with industry standards and company objectives. - Conduct interactive and engaging classes, workshops, and training sessions for individuals and teams. - Provide constructive feedback, guidance, and support to students to facilitate their learning and development. - Collaborate with company teams to integrate graphics design principles into various projects and initiatives. - Stay updated on the latest trends, tools, and technologies in graphics design and incorporate them into instructional materials and teaching methodologies.  Requirements:   - Proven experience in teaching, training, or mentoring individuals in graphics design.  - Proficiency in industry-standard graphics design software such as Adobe Creative Suite (Photoshop, Illustrator, InDesign, etc.).  - Excellent communication, presentation, and interpersonal skills.  - Strong organizational and time management abilities.     - Ability to work effectively both independently and as part of a team.  Preferred Qualifications:  Experience working in a corporate or professional training environment. Familiarity with instructional design principles and methodologies.  Benefits:  Comprehensive benefits package Opportunities for professional development and advancement  Collaborative and supportive work environment  __________________  Private Client  2 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709011993,
      "link": "https://t.me/freelance_ethio/64486",
      "content": "Job Title: Digital Marketer and social Media Influencer  Job Type: Remote - Permanent (Full-time)  Job Sector: #Media_and_communication  Work Location: from Anywhere/remote  Experience Level: Junior  Vacancies: 2  Applicants Needed: Female  Salary/Compensation: 48000 ETB Monthly  Deadline: 12/3/2024  Description: - Content Creation and Management  - Develop marketing strategies that align with the organization's business goals   • Manage and execute campaigns across various digital channels, including email, social media, search engines, and display advertising  • Measure and report on the performance of digital marketing campaigns, and assess against goals (ROI and KPIs) • Conduct market research and analyze trends to identify new opportunities and improve campaign performance • Collaborate with cross-functional teams, including creative, content, and web development, to produce engaging content and optimize user experience • Stay up-to-date with emerging digital marketing trends and technologies  __________________  Biruk zewdie [Verified Company ✅]  3 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709010621,
      "link": "https://t.me/freelance_ethio/64485",
      "content": "Job Title: Junior Frontend Software Developer  Job Type: On-site - Permanent (Full-time)  Job Sector: #Software_design_and_Development  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: -Design Frontend  of Software  using different Tools  -Work with developers to design algorithms and flowcharts -Produce clean, efficient code based on specifications -Integrate software components and third-party programs -Verify and deploy programs and systems Troubleshoot, debug and upgrade existing software -Gather and evaluate user feedback -Recommend and execute improvements -Create technical documentation for reference and reporting -Provide onsite training  - is able to work on remoter areas  - Preparation of Software Documents  -required  to work additional time after working hour  - Excepted to handle work load  - Submit Daily report and weekly Task plan  __________________  AM & BF Trading PLC [Verified Company ✅]  6 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709009460,
      "link": "https://t.me/freelance_ethio/64484",
      "content": "Job Title: Architect  Job Type: Remote - Permanent (Full-time)  Job Sector: #Architecture_and_urban_planning  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Description: Description: We are looking for a talented and experienced Architect who is able to perform,   - Building Design - Interior Design - Preparation of Detail Drawings - Quality Rendering - Prepare presentations and  animations  - Site supervision - Prepare all the necessary construction documents   * Also He/She must be experienced in Interior Design softwares like   -AutoCAD  -Revit -3Ds max -Twinmotion - Lumion -Enscape  * please send your portfolio's and academic credentials. We appriciate mentioning living area (location)  Only Shortlisted candidates will be contacted  __________________  A dot Studio design and construction plc [Verified Company ✅]  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709009279,
      "link": "https://t.me/freelance_ethio/64483",
      "content": "Job Title: ጸሐፊና ረዳት አስተዳደር  Job Type: On-site - Permanent (Full-time)  Job Sector: #Secretarial_and_office_management  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Vacancies: 1  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: የትምህርት ዝግጅት ፦ በሴክሬተሪያል ሳይንስ ዲፕሎማ እና በማንኛውም የቢዝነስ የትምህርት መስክ የመጀመሪያ ዲግሪ የሥራ ልምድ ፦ አምስት ዓመትና ከዚያ በላይ  አድራሻ ፦ ጀሞ 1 መስታወት ፋብሪካው ፊት ለፊት ☎️ 0940145151 / 0993353887  __________________  ቪዥን የአመራር እና የትምህርት ማማከር [Verified Company ✅]  4 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1709009268,
      "link": "https://t.me/freelance_ethio/64482",
      "content": "Job Title: Accountanting and finance  Job Type: On-site - Permanent (Full-time)  Job Sector: #Accounting_and_finance  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 12/3/2024  Description: Job Description Accounting and finance As a crutial member of the team the candidate should be skilled to perform the following tasks •  Accountant responsibilities include auditing financial documents and procedures, reconciling bank statements and calculating tax payments and returns •  Provide the accurate quantitative information on financial position, liquidity and cashflow of the company. •  Able to assist and Manage office tasks  •  Producing financial reports related to budgets, account payables, account receivables, expenses, balance sheets, profit/loss statements etc •  Manage all accounting transactions, Ensure timely bank payments •   Publish financial statements in time •   Handle monthly, quarterly and annual closings •  Record keeping: record all payments and invoices accurately. •  Comply with financial policies and regulations and current ERCA legislation, •  Prepare and Pay/Settle tax Payments to the tax authority  Personal qualities  •  Proactive, communication skills and team worker Qualification  •  B.A. degree in Accounting and Finance  •  Work Experience of minimum of 1 year is required •  Advanced MS Excel and Peachtree skills are required  __________________  Engida Travel Technology PLC [Verified Company ✅]  2 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708975575,
      "link": "https://t.me/freelance_ethio/64479",
      "content": "Job Title: Production Design Intern  Job Type: On-site - Intern (Paid)  Job Sector: #Media_and_communication  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Position Overview: We are seeking a passionate and creative Production Design Intern to join our team. This internship offers an excellent opportunity for individuals looking to gain hands-on experience in the exciting field of video production design. As a Production Design Intern, you will work closely with our talented team of producers, directors, and designers to bring creative visions to life.  Responsibilities:  • Collaborate with the production team to develop and execute visually stunning concepts for video projects.  • Assist in creating mood boards, sketches, and storyboards to communicate design ideas effectively.  • Participate in set design, prop sourcing, and art direction during filming sessions.  • Support the post-production process by providing input on color correction, graphic overlays, and visual effects.  • Maintain organized records of design assets and assist in managing production budgets.  Requirements:  • Recently graduated from a degree program in architecture, film, media production, design, or related field.  • Strong proficiency in design software such as Adobe Creative Suite (Photoshop, Illustrator, InDesign).  • Excellent communication and collaboration skills.  • A keen eye for detail and a passion for creative storytelling.  • Ability to work in a fast-paced environment and manage multiple projects simultaneously.  • Previous experience in video production or design is a plus but not required.  Benefits:   • Hands-on experience working on real-world projects alongside industry professionals.  • Mentorship and guidance from experienced professionals in the field.  • Networking opportunities within the video production industry.  • Potential for future employment opportunities based on performance.  __________________  Private Client  5 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708967775,
      "link": "https://t.me/freelance_ethio/64478",
      "content": "Job Title: የስፌት ስራ  Job Type: On-site - Permanent (Full-time)  Job Sector: #Clothing_and_Textile  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 9/3/2024  Description: ድርጅታችን ጋርመንት ሰራተኛ ይፈልጋል፡፡ ስለሆነም ስፌት የምትችል ሰራተኛ አወዳድሮ መቅጠር ይፈልጋል፡፡ የስራ ቦታ ሲሜሲ የስራ ሰዓት ከሰኞ_ቅዳሜ  ከጥዋት 2:00-11:00 ስልክ 0933555418  __________________  Private Client  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708965221,
      "link": "https://t.me/freelance_ethio/64477",
      "content": "Job Title: One to one assistance for 5yr old kid  Job Type: On-site - Contractual  Job Sector: #Teaching_and_Tutor  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Female who have a good heart to work with kids , has good time management skills, creativity, knows how to create fun with learning and ready to learn new things.  __________________  Private Client  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708961898,
      "link": "https://t.me/freelance_ethio/64476",
      "content": "Job Title: Senior English Teacher  Job Type: On-site - Part-time  Job Sector: #Teaching_and_Tutor  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Salary/Compensation: Monthly  Deadline: 9/3/2024  Description: About Us Sewa-Sew Academy, an online language school in Addis Ababa, offers high-quality English courses for all levels. Founded in 2022, the academy aims to spread knowledge and skills, helping people achieve their dreams.  Job Location  - Addis Ababa  Gender  - Females highly encouraged  Responsibilities  - Plan, deliver, and assess English language instruction to students of all levels according to the academy's manual and standards on YouTube, TikTok, as well as live Zoom.  - Develop and implement lesson plans that are aligned with the academy’s curriculum.  - Create a positive and engaging learning environment for students.  - Assess the students' progress, conduct continuous follow up and provide support accordingly.  - Finalize the course by assessing students' language improvement and providing them with final recommendations.  - Contribute to the development of the academy's manual.  - Stay up-to-date on the latest trends in English language teaching.  Qualifications  - The candidate must be creative and confident in front of a camera.  - Minimum of 3+ years of experience teaching English in language schools.  - Strong understanding of English grammar and linguistics.  - Excellent communication and presentation skills.  - Proficient in using Microsoft Office Suite and Google Productivity Apps.  - Commitment to students’ success.  Salary and Benefits  - Negotiable  - As the company grows, so do our employees.  - You will get the chance to make a positive impact on the education of others.  __________________  Private Client  28 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708959205,
      "link": "https://t.me/freelance_ethio/64475",
      "content": "Job Title: An Architect and a Salesperson  Job Type: On-site - Permanent (Full-time)  Job Sector: #Architecture_and_urban_planning  Work Location: Addis Ababa, Ethiopia  Experience Level: Expert  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: We are currently looking for experienced, skilled, and innovative individuals to join our team.  Qualifications: - degree in Architecture. - Prior experience in furniture or interior design architecture. - Proficient in architectural design software. - Excellent communication and presentation skills. - Capable of working effectively in both team and independent settings. - Ability to work efficiently and meet deadlines. - Stay up-to-dare on industry trends, software, and product knowledge. - Fluent in English. - Must have a personal laptop.  Applicants must submit a comprehensive portfolio demonstrating their abilities. If you meet the requirements, please send your resume and portfolio to yusrahomes@gmail.com.  Contact us for further information at +251988997777  Apply now & Join our team and be part of our success.  __________________  Yusra home [Verified Company ✅]  7 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708958366,
      "link": "https://t.me/freelance_ethio/64474",
      "content": "Job Title: Senior Graphics Design Instructor  Job Type: On-site - Part-time  Job Sector: #Training_and_Mentorship  Work Location: Addis Ababa, Ethiopia  Experience Level: Expert  Salary/Compensation: Hourly  Deadline: 11/3/2024  Description: We are seeking a highly skilled and professional advanced graphics design instructor.   Qualifications: ■ Bachelor's/Master's in Graphic Design, architecture or related field. ■  Minimum 2 years of teaching or extensive graphic design experience. ■ Proficient in Adobe Creative Suite (Photoshop, Illustrator, InDesign). ■  Excellent communication and interpersonal skills. ■ Passion for education and student success.  Responsibilities ■ Conduct engaging classes on design principles and industry trends. ■ Develop and update curriculum to align with industry standards. ■ Foster a positive learning environment, encouraging creativity. ■ Stay updated on emerging trends and technologies in graphics design. ■ Collaborate with fellow instructors for a cohesive learning experience.  __________________  Sage Training Institute [Verified Company ✅]  82 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708957723,
      "link": "https://t.me/freelance_ethio/64473",
      "content": "Job Title: Professional Receptionis  Job Type: On-site - Permanent (Full-time)  Job Sector: #Secretarial_and_office_management  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Vacancies: 1  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Lucid Pictures: At Lucid Pictures, we craft compelling video content that connects brands with their audiences. Our team of experienced professionals collaborates closely with clients to understand their vision and bring their stories to life. Whether you're looking for a product explainer, a powerful documentary, or anything in between, we have the expertise and dedication to deliver. Join our team: We're seeking a detail-oriented and professional Receptionist to join our vibrant production company. As the first point of contact, you'll play a vital role in shaping a positive and efficient work environment for our team and visitors. Responsibilities: Welcome visitors: Greet visitors warmly, answer their questions, and direct them to the appropriate person or department. Maintain security: Uphold a secure environment by monitoring visitor access, issuing badges, and following security protocols. Manage communication: Answer phone calls and emails professionally, screen calls as needed, and connect callers with the right person promptly. Schedule effectively: Create and maintain accurate schedules for meetings, appointments, and events. Ensure smooth operations: Manage administrative tasks, including filing documents, photocopying, printing, and sending mail. Maintain records: Keep track of visitor logs, appointment schedules, and other administrative records. Order office supplies: Proactively ensure the office is well-equipped with necessary supplies. Qualifications: Strong communication and interpersonal skills: Ability to interact professionally and courteously with visitors, staff, and clients. Proficient in Microsoft Office Suite: Experience with Word, Excel, Outlook, and PowerPoint. Excellent organizational and time management skills: Ability to prioritize tasks, meet deadlines, and manage a fast-paced environment. Discreet and confidential: Maintain the privacy of sensitive information. Flexibility and adaptability: Ability to handle diverse tasks and situations with a positive attitude. Fluency in Amharic & English (spoken and written) Bonus points: Prior experience in a production company environment. Bachelor's degree in any field. Work hours: Full time (40 hours per week) Ready to join our team? Send your resume and cover letter to lucid@lucidpicturesplc.com or apply here.  __________________  Lucid Pictures PLC [Verified Company ✅]  2 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708957708,
      "link": "https://t.me/freelance_ethio/64472",
      "content": "Job Title: Personal Assistant  Job Type: On-site - Permanent (Full-time)  Job Sector: #Customer_service_and_care  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Vacancies: 1  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Responsibilities: - Run errands, buy groceries, and walk dogs. - Provide assistance with household, financial and transport tasks and maintain confidentiality.  Mus have: - Excellent organizational and multitasking skills. - Strong attention to detail and problem-solving abilities. - Excellent communication skills, both verbal and written. - Reliable, trustworthy, and able to maintain confidentiality. - Physical ability to handle tasks such as carrying groceries and walking dogs.  Must have: - A valid driver's license - A personal smart phone for effective communication  __________________  Private Client  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708955841,
      "link": "https://t.me/freelance_ethio/64471",
      "content": "Job Title: Digital Marketer  Job Type: On-site - Permanent (Full-time)  Job Sector: #Marketing_and_Advertisement  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 1  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Digital Marketer  We are looking for a talented digital marketer with a strong front-end background to join our team. The ideal candidate will have a proven track record of success in developing, implementing, tracking, optimizing, and executing our digital marketing campaigns across all digital channels and the ability to design and develop high-quality front-end web pages.   Responsibilities  • Work with the web development team to design and develop high-quality front end web pages. • Design, build and maintain our social media presence • Measuring and reporting on the performance of all digital marketing campaigns • Manage the digital marketing of the company’s publications  • Ensure that the brand message is consistent  • Develop and execute comprehensive digital marketing strategies to drive online traffic, brand awareness, and lead generation. • Stay up-to-date with the latest trends and technologies in digital marketing to ensure the organization's competitiveness. • Content Marketing: • Plan and create engaging and shareable content for various digital platforms, including social media, blogs, and email marketing. • Collaborate with the content team to ensure consistency and alignment with overall marketing goals. • Social Media Management: • Manage and optimize social media platforms to enhance brand visibility and engagement. • Create, schedule, and analyze social media content and campaigns. SEO and SEM: • Conduct keyword research and implement on-page and off-page SEO strategies to improve organic search rankings. • Manage and optimize paid advertising campaigns (SEM) on platforms like Google Ads. Email Marketing: • Develop and execute email marketing campaigns, including audience segmentation, content creation, and performance analysis. • Monitor and optimize email deliverability and engagement rates. Analytics and Reporting: • Utilize analytics tools to track, measure, and report on the performance of digital marketing campaigns. • Provide insights and recommendations for continuous improvement. Requirements and skills • Bachelor's degree in marketing, web development, or a related field. • Experience with front end web development, including HTML, CSS, and JavaScript. • Proven working experience in digital marketing • Demonstrable experience leading and managing, marketing database, email, social media and/or display advertising campaigns • Highly creative with experience in identifying target audiences and devising digital campaigns that engage, inform and motivate • Solid knowledge of website analytics tools  • Strong analytical skills and data-driven thinking • Up-to-date with the latest trends and best practices in online marketing and measurement How to Apply: To apply, please submit your resume and a cover letter outlining your relevant experience (africatechnologyethio@gmail.com) however, only those selected for an interview will be contacted. Application Deadline: March 7/2024.  __________________  Africa Technology plc [Verified Company ✅]  34 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708955711,
      "link": "https://t.me/freelance_ethio/64470",
      "content": "Job Title: Junior sales and Service Engineer  Job Type: On-site - Permanent (Full-time)  Job Sector: #Mechanical_and_Electrical_engineering  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: We are looking for a fresh candidate who has graduated in Electrical and Electromechanical Engineering, Biomedical Engineering and Mechanical Engineering. The potential candidate is expected to have good technical and communication skill. Having occupational certificate is advantageous.  __________________  Abulkhase PLC [Verified Company ✅]  9 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708955618,
      "link": "https://t.me/freelance_ethio/64469",
      "content": "Job Title: Recruitment Officer  Job Type: On-site - Permanent (Full-time)  Job Sector: #Human_resource_and_talent_management  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Description:  We are seeking a highly motivated and enthusiastic individual to join our team as a junior HR. As a junior HR, you will have the opportunity to support our HR team in day-to-day operations and gain insights into HR functions such as recruitment, employee relations, training and development.    Responsibilities:    - Privide recruitment support at every angle - Assist in creating job postings and advertisements.  - Screen resumes and conduct initial candidate assessments.  - Coordinate interview schedules and provide logistical support.  - Update candidate information in the applicant tracking system. - Contact potential candidates via social platforms   Requirements  • BA in human resources management, Business Administration, or Management • Good communication, interpersonal, influencing, and negotiation skills; • Team player and capacity to work with others. • Must have EXCELLENT written and spoken communications skills • Knowledge of Finance for Payroll administration is advantageous. •  Experience in Years: 1 and above •  Level of Education: Bachelor Degree  __________________  Melhiq Consult PLC [Verified Company ✅]  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708951324,
      "link": "https://t.me/freelance_ethio/64467",
      "content": "Job Title: Graphic designer  Job Type: On-site - Contractual  Job Sector: #Creative_art_and_design  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Vacancies: 1  Applicants Needed: Male  Salary/Compensation: 4000 ETB Monthly  Deadline: 11/3/2024  Description: We are currently seeking a talented and creative individual to join our team as a Graphic Designer. Flexibility and adaptability Skills. Clear communication skills. The applicant must be #protestant and live in around #Gerji.   How to Apply: Please submit your resume and your portfolio showcasing relevant work to jobs @cheregc  __________________  GC Brand Solutions [Verified Company ✅]  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708951180,
      "link": "https://t.me/freelance_ethio/64466",
      "content": "Job Title: sales  Job Type: Remote - Contractual  Job Sector: #Marketing_and_Advertisement  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Salary/Compensation: 15000 ETB Monthly  Deadline: 11/3/2024  Description: we are  looking for senior pharmacist,Midwifes,BSC nurse,nutritionist,Public health specialists  for sales position for infant formula product with two years sales and marketing experience and with good communication skill, digital marketing and work discipline the job is contractual  for 2 month  with 15000 birr gross monthly salary beside there will be  attractive commission based on target  __________________  Rediet Mesfin Endalamaw [Verified Company ✅]  8 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708951006,
      "link": "https://t.me/freelance_ethio/64465",
      "content": "Job Title: Recpetion for language center  Job Type: On-site - Permanent (Full-time)  Job Sector: #Teaching_and_Tutor  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: We are hiring receptions for our language centers located in Addis Ababa.Employees are expected to perform duties that are assigned by the company and work coordinately with their coworkers to achieve company’s goal. The salary is gross 14500. Working days are from Monday to Saturday from 3 morning to 1 evening.candidates are expected to speak and listen both tigregna and amharic.  __________________  Language training center [Verified Licensed Startup 🚀]  22 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708950615,
      "link": "https://t.me/freelance_ethio/64464",
      "content": "Job Title: Secretary  Job Type: On-site - Permanent (Full-time)  Job Sector: #Secretarial_and_office_management  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: ICOS Consulting PLC is a regional development and management consulting firm headquartered in Addis Ababa (Ethiopia), with over 15 years of experience in the provision of tailored consultancy and research solutions for private and public actors in Africa.  We are seeking a highly organized and detail-oriented Secretary to join our team and provide essential administrative and bookkeeping support for ICOS Consulting and its sister company. The ideal candidate will possess excellent administrative skills along with a good background in accounting/bookkeeping to effectively manage both administrative and financial tasks. Responsibilities: Secretarial Duties: Organize calendars, coordinate meetings, and maintain filing systems. Handle correspondence, schedule appointments, and manage office activities, manage administrative staff and drivers, track the whereabouts of drivers and vehicles frequently. Ensure the office environment is conducive to productivity. Accounting/Bookkeeping Tasks: Maintain accurate financial records, process invoices and payments, reconcile bank statements, and prepare financial reports. Collaborate with accountants, ensure tax compliance, and manage financial documentation. Qualifications: Education: TVET+4/5 or bachelor's degree in Secretarial Science, Office Management, Accounting, Finance, or related fields. Experience: Previous experience in office administration and/or accounting preferred. Skills: Proficiency in accounting software (e.g., QuickBooks), MS Office Suite, and typing speed of 40+ words per minute. Excellent organizational, communication, and multitasking abilities required. Other: Familiarity with tax regulations, integrity in handling confidential information, and ability to work independently. Benefits: Negotiable salary and other benefits. How to Apply: If you're proactive and passionate about administrative and financial responsibilities, send your application, resume, and credentials to icosconsulteth@gmail.com or jobs@icosconsult.com by March 5, 2024. Only shortlisted candidates will be contacted.  __________________  MassDel Commission Agent [Verified Company ✅]  6 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708949441,
      "link": "https://t.me/freelance_ethio/64463",
      "content": "Job Title: Senior Graphics Designer  Job Type: On-site - Permanent (Full-time)  Job Sector: #Media_and_communication  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Company Overview: D!NK Multimedia is a dynamic and innovative entertainment company that thrives on creativity, pushing boundaries, and delivering engaging content to a diverse audience. We are currently seeking a highly skilled Graphics Designer to join our team and contribute to the visual appeal of our various projects.  Job Overview: As a Senior Graphics Designer at D!NK Multimedia, you will play a crucial role in conceptualizing and creating visually stunning designs across multiple platforms. From show promotions to marketing materials, your work will be instrumental in capturing our audience's attention and enhancing the overall brand image.  Responsibilities: 1. Collaborate with the creative team to understand project requirements and objectives. 2. Design compelling graphics, illustrations, and visual elements for digital and print materials. 3. Create visually appealing promotional materials for shows, events, and social media campaigns. 4. Develop and maintain a cohesive visual identity across all platforms. 5. Stay updated on design trends and incorporate innovative ideas into projects. 6. Work closely with the marketing team to ensure consistency in branding and messaging. 7. Manage multiple design projects simultaneously and meet deadlines. 8. Incorporate feedback from team members and stakeholders to refine designs.  Qualifications: 1. Proven experience as a Graphics Designer, preferably in the entertainment or media industry. 2. Proficient in graphic design software, including Adobe Creative Suite (Photoshop, Illustrator, InDesign). 3. Strong portfolio showcasing a diverse range of design projects. 4. Excellent communication and collaboration skills. 5. Ability to adapt to fast-paced environments and evolving project requirements. 6. Up-to-date with industry trends and design best practices.  How to Apply: If you are a visionary and highly creative professional graphic designer with a passion for content packaging, branding, and delivering immersive multimedia experiences, we'd love to hear from you. Send your CV at hello@dinktv.com.  __________________  D!Nk multimedia PLC [Verified Company ✅]  71 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708948377,
      "link": "https://t.me/freelance_ethio/64462",
      "content": "Job Title: Digital marketing expert  Job Type: On-site - Permanent (Full-time)  Job Sector: #Media_and_communication  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Applicants Needed: Female  Salary/Compensation: Fixed (One-time)  Deadline: 11/3/2024  Description: we are looking for dynamic Digital Marketing Expert to join our team.   Responsibilities: Design and execute digital marketing campaigns. Analyze campaign performance and optimize strategies. Stay updated on industry trends and tools. Collaborate with cross-functional teams.  Requirements: Bachelor's degree in field.  1+ years of digital marketing experience. Proficiency in  social media platforms. Strong analytical and communication skills. And English skill  __________________  Fundisha [Verified Company ✅]  11 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708948255,
      "link": "https://t.me/freelance_ethio/64461",
      "content": "Job Title: Graphics designer paid internship  Job Type: On-site - Permanent (Full-time)  Job Sector: #Creative_art_and_design  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Salary/Compensation: 5000 ETB Monthly  Deadline: 11/3/2024  Description: dynamic Graphic Design Internship for creative minds!  Responsibilities:Create visual content for digital and print media .Collaborate with the marketing team .Maintain brand consistency .Participate in brainstorming sessions  Requirements:  .Proficiency in Adobe Creative Suite .Strong creative thinking skills.  __________________  Fundisha [Verified Company ✅]  10 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708947505,
      "link": "https://t.me/freelance_ethio/64460",
      "content": "Job Title: Sales  Job Type: On-site - Contractual  Job Sector: #Sales_and_Promotion  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Vacancies: 2  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 8/3/2024  Description: Sales   Energetic full time Sales with good communication skill who can respond to customer enquiries, handle customers professionally and respectfully. Should have a good understanding of sales techniques and customer relations.           Role: Answer phone calls Handling customers and closing deals Proper and timely entry of customer records on the system Regularly visit and engage with customers at field sales sites         Requirements: Degree/ Diploma in marketing and other related fields 0 or above years of experience in sales and marketing A good understanding of Google suite  __________________  Private Client  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708947280,
      "link": "https://t.me/freelance_ethio/64459",
      "content": "Job Title: የብረት በያጅ ባለሙያ  Job Type: On-site - Permanent (Full-time)  Job Sector: #Manufacturing_and_production  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Vacancies: 5  Applicants Needed: Male  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: 1. 8ኛ ክፍል የጨረሰ 2. የመኖርያ ቦታው ለፒያሳ ቅርብ የሆነ 3. መበየድ ፣ መቁረጥ ፣ በኮምፕረሰር መቀባት የሚችል። ከዚህ በፊት የተለያዩ ስራዎች ላይ የተሳተፈ እና በቂ ልምድ ያለው 4. የስራ ተነሳሽነት ያለው ፣ በውጥረት ጊዜ ስራዎችን በቅልጥፍና ማስረከብ የሚችል   5. ደሞዝ - በስምምነት  __________________  Axis Finishing Works PLC [Verified Company ✅]  8 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708946161,
      "link": "https://t.me/freelance_ethio/64458",
      "content": "Job Title: Sales  Job Type: On-site - Contractual  Job Sector: #Sales_and_Promotion  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Our company is looking for sales to promot our service on different locations in person. Leave your phone number on the applications  __________________  Happy kids ICT PLC [Verified Company ✅]  2 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708939144,
      "link": "https://t.me/freelance_ethio/64456",
      "content": "Job Title: እንግዳ ተቀባይ  Job Type: On-site - Permanent (Full-time)  Job Sector: #Media_and_communication  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: በፎቶ ቤታችን እንግዳን በአግባቡ መቀበል ምትችል  ከሰኞ-ቅዳሜ የስራ ቦታ ቦሌ ኤድናሞል  ደሞዝ በስምምነት  __________________  Private Client  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708939052,
      "link": "https://t.me/freelance_ethio/64455",
      "content": "Job Title: Sales woman  Job Type: On-site - Permanent (Full-time)  Job Sector: #Sales_and_Promotion  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Vacancies: 1  Applicants Needed: Female  Salary/Compensation: 3000 ETB Monthly  Deadline: 11/3/2024  Description: Sales Person for Gift Home Decor shop Woman Age 18-22 Shop-around Bisrate Gebriel ke Queens supermarket wered blo  __________________  Private Client  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708938769,
      "link": "https://t.me/freelance_ethio/64454",
      "content": "Job Title: Bicycle rider  Job Type: Remote - Contractual  Job Sector: #Transportation_and_Delivery  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 10  Applicants Needed: Male  Salary/Compensation: Hourly  Deadline: 11/3/2024  Description: Job Title: ሳይክለኛ Bicycle Rider  Job Type: On-site - Permanent (Full-time)  Job Sector: Transportation_and_Delivery  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Vacancies: 10  Applicants Needed: Male  Salary/Compensation: Monthly  Deadline: 13/1/2024  Description: ኃላፊነቶች፡- -  Google map መጠቀም የሚችል -  Smart phone ያለው -  ፈጣን እና ቀልጣፋ የሆነ  -  የአዲስ አበባን መንገዶች በቶሎ ለመልመድ ማይቸገር  -  ጥሩ የመግባባት ችሎታ ያላው  -  እንግሊዘኛ ለመናገር ሚሞክር -  ዲሊቨሪ አገልግሎት የሰራ ቢሆን ይመረጣል            የአስፈላጊ ነገሮች:- -  የራሱ ሳይክል ያለው ቢሆን ይመረጣል - የሚጠየቀውን ዋስ ማምጣት የሚችል  -  የታደሰ የአዲስ አበባ መታወቂያ ያለው   ✅ ደሞዝ እና ጥሩ ሚባል ኮሚሽን ያገኛሉ የስራ ስዓት: ከጥዋት 3 እስከ ምሽት 2:30 በሚመርጡት ፈረቃ።  __________________  ROD TECHNOLOGIES [Verified Licensed Startup 🚀]  12 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708938654,
      "link": "https://t.me/freelance_ethio/64453",
      "content": "Job Title: Hotel Front Office Receptionist  Job Type: On-site - Permanent (Full-time)  Job Sector: #Hospitality_and_Tourism  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Hotel Front Desk Agent or Receptionist  is a professional who is responsible for greeting guests in an efficient and courteous manner. As the first face that many see upon arrival, the Hotel Front Desk Agent checks guests in and out of their rooms, distributes room keys, answers questions and processes payments for hotel services.  __________________  Maishum Lodge PLC(Mazeki Hotel) [Verified Company ✅]  9 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708937866,
      "link": "https://t.me/freelance_ethio/64452",
      "content": "Job Title: Social media manager  Job Type: On-site - Permanent (Full-time)  Job Sector: #Multimedia_content_production  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Social media managers responsible for developing strategies to increase followers, creating and overseeing social campaigns, producing content, reviewing analytics, and communicating with key stakeholders in a company.  __________________  Private Client  18 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708937312,
      "link": "https://t.me/freelance_ethio/64451",
      "content": "Job Title: Content Writer and Voiceover Journalist  የጽሁፍ አዘጋጅ እና በድምጽ አቅራቢ  ጋዜጠኛ  Job Type: On-site - Permanent (Full-time)  Job Sector: #Multimedia_content_production  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: አስቸኳይ የሥራ ማስታወቂያ  1. ተፈላጊ ችሎታ እና መስፈርት ፦ ከላይ በተጠቀሰው የሥራ ዘርፍ ላይ በተለያዪ አስገራሚ፤ አስደናቂ እና አዝናኝ እንዲሁም ወቅታዊ ጉዳዮችን በጽሁፍ በጥሩ ሁኔታ አዘጋጅቶ ማቅረብ የምትችል /የሚችል -  2. የተዘጋጁትን ጽሁፎች ጥሩ ሁኔታ አንብቦ ማቅረብ  የምትችል /የሚችል -  3.  በኮሙኒኬሽን፣ ብሮድካስቲንግ፣ ጋዜጠኝነት፣ ሬዲዮ ፤ ወይም በማህበራዊ ሚድያ የሰራውን ስራ ሳምፕል ማሳየት የሚችል/ የምትችል  (አስፈላጊ) 4. ለማምበብ የሞሆን ጥሩ ድምጽ ያለው /ያላት (አስፈላጊ) 2. የሥራ ልምድ ፦ 1 ዓመት  3. ብዛት ፦ ሁለት(2) 4. ደሞዝ ፦ በስምምነት 5. አድራሻ ፦ አዲስ አበባ ጀሞ -1  __________________  Hulu Daily [Verified Unlicensed Startup 🚀]  4 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708937282,
      "link": "https://t.me/freelance_ethio/64450",
      "content": "Job Title: የሱቅ ሽያጭ ሰራተኛ  Job Type: On-site - Permanent (Full-time)  Job Sector: #Creative_art_and_design  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: ቀልጣፋና ጎበዝ የሽያጭ ሰራተኛ ለስጦታ ዕቃ ሱቃችን እንፈልጋለን።  ስለ ስጦታና የፕሮግራም ዕቃ በቂ ዕውቀት ቢኖራት ይመረጣል።  በቋሚነት ለረጅም ጊዜ ለመስራት ዝግጁ የሆነችና መኖሪያዋ ጀሞ አከባቢ የሆነ።   ዋስ የመንግስት ሰራተኛ ማቅረብ የምትችል  የትምህርት ደረጃ - 12 diploma   የስራ ሰአት ከጠዋቱ 3:00 - 2:00     የስራ ቀን ከሰኞ - ቅዳሜ  ደሞዝ 3000  @blackandwhitegift በዚህ የቴሌግራም አካውንት የትምህርት ማስረጃ፣ የስራ ልምድ ካለና የመኖሪያ ሰፈር በመጥቀስ ማመልከት ይቻላል።  __________________  Black and white gift shop [Verified Company ✅]  5 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708937254,
      "link": "https://t.me/freelance_ethio/64449",
      "content": "Job Title: Secretary  Job Type: On-site - Permanent (Full-time)  Job Sector: #Secretarial_and_office_management  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Vacancies: 2  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: 1. Basic Computer Skills  2. Proficiency in writing documents in English and Amharic  3. Answering and making phone calls  4. Welcoming clients and providing assistance  5. Excellent communication skills  __________________  Town Foreign Employment Agency [Verified Company ✅]  3 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708936519,
      "link": "https://t.me/freelance_ethio/64448",
      "content": "Job Title: sales  Job Type: Remote - Freelance  Job Sector: #Sales_and_Promotion  Work Location: Addis Ababa, Ethiopia  Experience Level: Entry level  Vacancies: 100  Salary/Compensation: Fixed (One-time)  Deadline: 11/3/2024  Description: አሽከርካሪዎችን እና የደንበኛ ተሳፋሪዎች የዋን ራይድን መተግበሪያ አውርደው እንዲጠቀሙ ማድረግ፣ ግንዛቤ መፍጠር፣  አሽከርካሪዎችን ባሉበት ቦታ ሄዶ መመዝገብና ለድርጅታችን ሪፖርት ማድረግ፡፡ ኃላፊነቶች፡- ስለዋን ራይድ መተግበሪያ ለአሽከርካሪዎችና ተሳፋሪዎች በቂ ግንዛቤ መፍጠር፣ ለመመዝገብ አስፈላጊ የሆኑትን ቅድመ ሁኔታዎችን እንዲያሟሉ በማድረግ እንዲመዘገቡ ማድረግ፣ አገልግሎታችንን በስፋት ለደንበኞች ተደራሽ ማድረግ እንዲቻል ከደንበኞች ጋር በቅርበት የሚሰራ የዋን ራይድን ስቲከር የተመዘገቡ መኪናዎች ላይ መለጠፍ ተፈላጊ ችሎታ፡- ፈጣን ቀልጣፋና ከአሽከርካሪዎች  ጋር ተግባብቶ መስራት የምትችል/የሚችል፣ አገልግሎቱን በተመለከተ የሚዘጋጁ ሰነዶችን አንብቦ/ የሚሰጥ አጭር ገለፃ በመጠቀም ግንዛቤ በመያዝ አሽከርካሪዎች እና ተሳፋሪዎችን ግንዛቤ ማስጨበጥ የሚችል/የምትችል.  __________________  Private Client  6 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708936271,
      "link": "https://t.me/freelance_ethio/64447",
      "content": "Job Title: Tiktoker and tiktok influencer  Job Type: Remote - Part-time  Job Sector: #Media_and_communication  Work Location: from Anywhere/remote  Experience Level: Intermediate  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Our company is looking for tiktokers with more than 10000 followers who has live experience which can promot our product on live stream  __________________  Happy kids ICT PLC [Verified Company ✅]  1 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708935348,
      "link": "https://t.me/freelance_ethio/64445",
      "content": "Job Title: Junior Accountant / Admin Assistant  Job Type: On-site - Permanent (Full-time)  Job Sector: #Accounting_and_finance  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Finance Manager Job Duties: •  Monitor the day-to-day financial operations within the company, such as payroll, invoicing, and other transactions •  Track the company's financial status and performance to identify areas for potential improvement •  Register, manage and quantify stocks and stock movements •  Seek out methods for minimizing financial risk to the company •  Research and analyze financial reports and market trends •  Provide insightful information and expectations to senior executives to aid in long-term and short-term decision making •  Review financial data and prepare monthly and annual reports •  Present financial reports to board members, stakeholders, executives, and clients in formal meetings •  Stay up to date with technological advances and accounting software to be used for financial purposes •  Establish and maintain financial policies and procedures for the company •  Understand and adhere to financial regulations and legislation by being updated to new circulars, regulations, guidelines and proclamations of the government in regards to tax laws •  Prepare a standard format, template and work instructions in regards to finance and planning •  Prepare annual and monthly budget of the company in collaboration with department head and get approval from the top management •  Prepares/ updates cash flow forecast for the financial year based on regular basis  •  Monthly and annual Tax declaration: VAT, Withholding, labor tax, Pension, income tax and report Admin assistant Job description  •  Using Microsoft word, Excel or other office document software, performs all typing and secretarial duties including but not  limited to answering phones, preparing meeting minutes, arranging and compiling files ( both hard and soft copy), and other office    procedures •  Responsible for the recording of daily accounting ledger in assisting the accountant. •  Responsible for arrangement of office furniture and computers •  Responsible for the proper use of office stationeries and controlling all office materials •  Responsible for preparing purchase orders •  Responsible for controlling office cleaning •  Responsible for the preparation and compilation of Tender documents in coordination with architects and engineers •  Assist the accountant in preparation of payroll and other expense documents. •  Responsible for the arrangement of office events  and parties Required Skills and Qualifications:  Education: Bachelor’s degree in Accounting and minimum of 3 (three) years of relevant experience; or Master’s degree in Accounting or finance and 1 (one) year of experience.  Skills: Good financial skills, leadership skills and experience, understanding of data privacy standards, solid communication skills, both written and verbal, public speaking skills; deep understanding of business principles and practices, superior attention to detail, organizational skills, planning skills; research skills; analytical skills; critical thinking skills; problem-solving skills; computer skills; multi-tasking abilities; integrity, honesty.  Salary: As per the company’s scale  Note: Interested Applicants are advised to send their CV and supporting documents by email to vacancy@etdynamic.com  within 10 days of this advertisement.  __________________  Dynamic Planners PLC [Verified Company ✅]  2 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708935235,
      "link": "https://t.me/freelance_ethio/64444",
      "content": "Job Title: Assistant teacher  Job Type: On-site - Permanent (Full-time)  Job Sector: #Teaching_and_Tutor  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: We are looking for an enthusiastic kindergarten  assistant teacher to foster and facilitate the intellectual and social development of the children. Teaching in kindergarten includes planning, implementing and assessing lessons. You will teach children with patience and creativity. Kindergarten Teacher duties include designing a teaching plan and using activities and instructional methods to motivate children.  Responsibilities - Design and follow a complete teaching plan - Teach alphabet and numeracy along with personal, social and emotional skills - Organize learning material and resources - Use a variety of activities and instructional methods (songs, stories, media, structured games, art, outdoor activities etc) to motivate and stimulate children’s abilities - Maintain an open line of communication with parents and provide appropriate information - Assess students performance and progress to ensure they are mastering the skills on regular basis - Monitor children’s interactions and nurture cooperation and sharing - Cooperate with administration staff - Follow and comply with teaching standards and safety regulations  Qualification - Bachelor's degree from an accredited college or university - Minimum of 2 years and above outstanding teaching experience.  - fluent in English  - Female  __________________  Spring gardens trading plc [Verified Company ✅]  16 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708933327,
      "link": "https://t.me/freelance_ethio/64443",
      "content": "Job Title: Tender Officer  Job Type: On-site - Permanent (Full-time)  Job Sector: #Information_technology  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: We are looking for young and energetic individual with the dedication and commitment, fitting our company's aspirations, ready to work on the Tender Officer activities within our company.  __________________  Amistades General Trading PLC [Verified Company ✅]  3 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708933259,
      "link": "https://t.me/freelance_ethio/64442",
      "content": "Job Title: Social Media Manager  Job Type: On-site - Permanent (Full-time)  Job Sector: #Creative_art_and_design  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Vacancies: 1  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Description: We are seeking a highly talented and energetic Social Media page Manager  Responsibilites 1. Creating Content Strategy 2. Scheduling Weekly, Monthly Posts 3. Creating Graphical And Video Content 4. Creating A montly report  5. properly manaing Documents  Skill and Experience 1. having Good Knoweldge in photoshop, illustrator & canva  2. 2 year experience in social media Managent 3. Great problem-solving skills and independent work ethics  __________________  Vejthani Ethiopia [Verified Company ✅]  5 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708933210,
      "link": "https://t.me/freelance_ethio/64441",
      "content": "Job Title: Messenger, Sales & Purchaser  Job Type: On-site - Permanent (Full-time)  Job Sector: #Purchasing_and_procurement  Work Location: Addis Ababa, Ethiopia  Experience Level: Junior  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: We are looking for young and energetic individual with the dedication and commitment, fitting our company's aspirations, ready to work on the Messenger, Sales & Purchasing activities within our company.  __________________  Amistades General Trading PLC [Verified Company ✅]  2 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708931320,
      "link": "https://t.me/freelance_ethio/64440",
      "content": "Job Title: HR Manager  Job Type: On-site - Permanent (Full-time)  Job Sector: #Human_resource_and_talent_management  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Applicants Needed: Female  Salary/Compensation: 10000 ETB Monthly  Deadline: 11/3/2024  Description: As the HR Manager at Ultra Communications, you will be a pivotal member of our team, responsible for overseeing all aspects of human resources management. You will collaborate with leadership to ensure a positive work environment, implement HR policies and procedures, and drive initiatives that support the professional development and well-being of our employees. Key Responsibilities: * Develop and implement HR policies and procedures in alignment with organizational goals. * Manage the full employee lifecycle, from recruitment and onboarding to performance management and offboarding. * Conduct regular training sessions on HR policies, diversity and inclusion, and other relevant topics. * Handle employee relations, conflict resolution, and provide guidance on HR-related matters. * Administer employee benefits and compensation programs. * Drive employee engagement initiatives and foster a positive workplace culture. * Lead recruitment efforts, including sourcing, interviewing, and selecting qualified candidates. * Maintain accurate and up-to-date HR records and documentation. * Ensure compliance with labor laws and regulations. * Collaborate with department heads to address staffing needs and organizational changes.  Job Requirements: * Bachelor's degree in Human Resources, Business Administration, or a related field. Master's degree or HR certification is a plus. * Proven experience as an HR Manager or similar role in a dynamic and creative environment. * Strong knowledge of HR principles, practices, and employment laws. * Excellent interpersonal and communication skills. * Ability to build positive relationships and work collaboratively with diverse teams. * Demonstrated problem-solving and conflict resolution abilities. * Experience in talent acquisition and recruitment strategies. * Proficient in HRIS and Microsoft Office Suite. * A strategic mindset with the ability to align HR initiatives with organizational goals.  __________________  The Greenhouse [Verified Company ✅]  11 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708929891,
      "link": "https://t.me/freelance_ethio/64439",
      "content": "Job Title: Accountant II  Job Type: On-site - Permanent (Full-time)  Job Sector: #Information_technology  Work Location: Addis Ababa, Ethiopia  Experience Level: Intermediate  Applicants Needed: Female  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: BLB Family Import is looking for Accountant to join a finance team. As an Accountant you will:- •  Manage import/export documentation (customs invoices, bills of lading, letters of credit) •  Calculate and book import duties, taxes, and fees •  Prepare and file import/export tax returns •  Monitor exchange rates and currency fluctuations •  Implement cost-effective trade finance solutions •  Analyze supplier invoices and bills of lading for accuracy and compliance •  Reconcile landed costs of imported goods •  Liaise with customs brokers and freight forwarders •  Stay updated on import/export regulations and compliance requirements •  Participate in internal control activities and ensure adherence to company policies •  Prepare budgets and forecasts for import/export activities •  Analyze and identify cost-saving opportunities in trade operations •  Assist with internal audits and external financial reporting •  Manage petty cash and other small disbursements •  Train and mentor junior accounting staff Required Skills and Experience: •  Bachelor's degree in Accounting or Finance •  3-5 years of accounting experience, preferably in import/export or international trade •  Strong knowledge of accounting principles (GAAP) and IFRS (if applicable) •  Excellent analytical and problem-solving skills •  Strong attention to detail and accuracy •  Effective communication and interpersonal skills •  Proficiency in relevant import/export regulations and compliance requirements •  Knowledge of customs procedures and international trade documents  __________________  Private Client  11 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708929664,
      "link": "https://t.me/freelance_ethio/64438",
      "content": "Job Title: Information technology administrator  Job Type: On-site - Permanent (Full-time)  Job Sector: #Information_technology  Work Location: Addis Ababa, Ethiopia  Experience Level: Senior  Salary/Compensation: Monthly  Deadline: 11/3/2024  Description: Kaleb Service Farmers House PLC is looking for IT Administrator who has an IT degree with more than  3YEARS  IT related work experience.   We are located in Kaliti , Addis Ababa.   1. System Maintenance: Ensuring the smooth operation of hardware, software, and network systems. 2. User Support: Providing technical support to end-users, troubleshooting issues, and offering solutions. 3. Security Management: Implementing and maintaining security measures to protect systems and data from unauthorized access, viruses, and other threats. 4. Network Administration: Managing network infrastructure, including routers, switches, firewalls, and VPNs. 5. Backup and Recovery: Implementing backup solutions and disaster recovery plans to safeguard data and minimize downtime. 6. Software Installation and Updates: Installing, configuring, and updating software applications across the organization. 7. Documentation: Maintaining detailed documentation of systems, configurations, procedures, and troubleshooting steps. 8. Hardware Procurement: Evaluating, purchasing, and deploying hardware assets as needed. 9. Performance Monitoring: Monitoring system performance and identifying areas for improvement or optimization. 10. Compliance: Ensuring systems adhere to regulatory requirements and industry standards. 11. Collaboration: Working closely with other IT team members, departments, and external vendors to support organizational goals and initiatives.  These duties may vary depending on the organization's size, industry, and specific technology infrastructure. Additionally, IT Administrators may be required to stay updated with the latest technologies and industry trends to effectively support their organization's IT needs.  Salary to be negotiated.  __________________  Private Client  5 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    },
    {
      "date": 1708872265,
      "link": "https://t.me/freelance_ethio/64437",
      "content": "Job Title: Software developer  Job Type: Remote - Intern (Unpaid)  Job Sector: #Software_design_and_Development  Work Location: from Anywhere/remote  Experience Level: Junior  Salary/Compensation: Unpaid  Deadline: 10/3/2024  Description: We are a software development company looking for a versatile Software Engineer with a background in full stack development and mobile app development. The ideal candidate will play a key role in designing, developing, and maintaining software solutions that drive our clients business forward.  Responsibilities:  - Design, develop, and maintain full stack software applications. - Develop and maintain mobile applications for iOS and Android platforms. - Manage server infrastructure and system administration tasks. - Collaborate with cross-functional teams to define, design, and ship new features. - Ensure the performance, quality, and responsiveness of applications. - Troubleshoot, debug, and optimise code for maximum performance.  Qualifications:  - Bachelor's degree in Computer Science, Software Engineering, or a related field. - experience as a Full Stack Software Engineer with experience in front-end and back-end technologies. - Solid experience in mobile app development for iOS and Android using frameworks such as React Native and Flutter. - Knowledge in server management and system administration tasks. - Strong problem-solving skills and attention to detail. - Excellent communication and teamwork skills.  Requirements:  - Professional experience in software development. - Experience with programming languages such as JavaScript, Python and dart. - Experience with modern web frameworks ( Laravel,  Express). - Knowledge of database systems (e.g., MySQL, PostgreSQL). - Familiarity with cloud services (e.g., AWS, Azure, or Google Cloud).  __________________  Private Client  3 Jobs Posted       From: @freelance_ethio | @freelanceethbot  For our Amharic Channel, Join @afriworkamharic"
    }
  ]
}
